import time
from aiogram import Bot
from aiogram.types import Message
from core.keyboards.inline import mbti_test_keyboard, to_result_mbti_keyboard, back_from_result
from core.handlers.basic import chat_text1
from core.handlers.basic import special


users_data = {}
deleter = {}
question = ['Ви відчуваєте втому після великої кількості соціальних взаємодій', 'Вам подобається проводити час на одинці', 'Ви надаєте перевагу невеликим групам людей', 'Ви відчуваєте себе некомфортно в шумних або переповнених місцях', 'Якщо мені потрібно вирішити проблему, я як правило вирішу її довірившись своїй інтуїції', 'Якщо я бачу нову ідею, чи проект, я швидко уявляю можливі напрямки розвитку та перспективи', 'Коли я працюю над завданням чи проектом, я дозволяю собі вільний потік думок та ідей', 'якщо моя перша спроба вирішити проблему не працює, я шукаю новий підхід, чи змінюю стратегію',
            'У моєму робочому оточені я більше ціную концепції, ідеї та можливості', 'Коли я вирішую проблему, я покладаюся на логічний аналіз', "У вирішенні складних ситуацій, я керуюся логікою та об'єктивними фактами", 'Коли я допомагаю іншим, то пропоную раціональні рішення та конкретні дії', "У моєму робочому оточені я більш ціную об'єктивність, логічний аналіз", 'Коли я приймаю важливе рішення, я зважую всі переваги та недоліки', 'Коли я приймаю рішення, я зазвичай враховую усі можливі альтернативні наслідки', 'У робочих ситуаціях я більше ціную чіткість, порядок та структуру', 'Коли я допомагаю іншим, я частіше вислуховую їхні аргументи та допомагаю розібратися в альтернативних ',
            'Під час обговорення проблеми я звертаю увагу на деталі та конкретні аспекти ситуації', 'Коли я приймаю важливе рішення, то аналізую всі факти та можливі наслідки']

person_text = {'INTJ': "Інтроверсія (I): INTJ віддають перевагу внутрішньому світу інтелектуальних роздумів та рефлексії. Вони надають більшу увагу власним думкам і ідеям, ніж зовнішнім подіям чи соціальним подіям.\n\nІнтуїція (N): INTJ уміють бачити ширше за очевидне і відчувають смисл і можливості поза звичайним сприйняттям. Вони мають схильність до стратегічного мислення та розробки новаторських ідей.\n\nМислення (T): Логіка важлива для INTJ, вони роблять рішення на основі об'єктивних фактів та аналізу, уникаючи емоційних впливів. Їхні рішення зазвичай ґрунтуються на раціональних аргументах.\n\nСудження (J): INTJ орієнтовані на результати і схильні до структурованості і організації. Вони часто ставлять чіткі цілі і працюють систематично, щоб досягти їх.\n\nЗагалом, INTJ цінують інтелектуальну незалежність, стратегічне мислення та цілеспрямованість. Вони часто знаходять успіх у ролях лідерства, наукових досліджень, технічних областях та управлінні проектами.",
               'INTP': "1. Логіка: INTP зазвичай віддає перевагу логіці та аналізу при вирішенні проблем і прийнятті рішень.\n\n2. Внутрішній світ: Вони насолоджуються власним внутрішнім світом думок і ідей, іноді перевіряючи їх на практиці.\n\n3. Творчість: Інтуїтивно-логічні типи часто мають сильний творчий потенціал, іноді виражений у сфері науки, техніки або мистецтва.\n\n4. Незалежність: Вони цінують свою незалежність і можуть працювати самостійно над проектами, уникаючи мікрокерування.\n\n5. Аналітичність: INTP схильні до аналізу деталей і виявлення закономірностей в інформації.\n\n6. Зацікавленість в ідеях: Вони можуть витрачати багато часу на роздуми над абстрактними концепціями і пошуком нових ідей.\n\n7. Незавершеність проектів: Іноді їх цікавість швидко може переходити з одного проекту на інший, що може призвести до незавершеності деяких завдань.\n\n8. Відстороненість: Іноді вони можуть бути відстороненими від соціальних ситуацій або виявляти відчуття незручності у великих групах.\n\nЦе лише загальна характеристика, і кожна особистість може мати унікальні варіації цих рис.",
               'ENTJ': "1. Екстраверсія: ENTJ схильні до екстравертного способу життя, насолоджуючись взаємодією з іншими і відчуттям енергії від соціальних подій.\n\n2. Лідерські якості: Вони зазвичай мають сильні лідерські якості і відчуття напрямку, і часто виявляються на чолі груп або організацій.\n\n3. Аналітичність: ENTJ шукають логічні рішення для проблем і стратегічно думають про майбутнє.\n\n4. Рішучість: Вони зазвичай мають впевненість у своїх діях і швидко приймають рішення.\n\n5. Ефективність: ENTJ цінують ефективність і швидкість вирішення завдань, можуть бути вимогливими до себе і до інших.\n\n6. Стратегічне мислення: Вони зазвичай мають здатність бачити цілі і розробляти стратегії для досягнення їх.\n\n7. Ентузіазм: ENTJ можуть бути дуже енергійними і пристрасними в тому, що роблять, що може бути захоплюючим для їхнього оточення.\n\n8. Незалежність думок: Хоча вони можуть бути впевненими в своїх думках, вони також цінують конструктивну критику і можуть бути відкритими до нових ідей.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні унікальні риси, які доповнюють або розширюють ці основні аспекти.",
               'ENTP': "1. Екстраверсія: ENTP зазвичай енергійні та відчувають себе комфортно у соціальних ситуаціях. Вони насолоджуються взаємодією з іншими та можуть бути центром уваги.\n\n2. Інтуїція: Їхній основний спосіб сприйняття світу - це інтуїція. Вони бачать можливості, здатні проникнути за обмеження та швидко знаходити нові шляхи до вирішення проблем.\n\n3. Логіка: ENTP володіють сильним аналітичним мисленням та здатністю аргументувати свої ідеї раціонально.\n\n4. Спонтанність: Вони часто відчувають себе вдячними за несподівані події та можуть радикально змінювати плани, якщо з'являються нові можливості.\n\n5. Ентузіазм: ENTP зазвичай відомі своїм ентузіазмом та живою реакцією на нові ідеї та виклики.\n\n6. Неформальність: Вони можуть бути неформальними та гнучкими в стосунках, шукаючи забаву та розваги.\n\n7. Незалежність думок: ENTP цінують свою незалежність та можуть відстоювати свої погляди, навіть якщо це суперечить загальноприйнятим стандартам.\n\n8. Креативність: Вони здатні до інноваційних рішень та непередбачуваних дій, шукаючи новаторські шляхи вирішення проблем.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного ENTP унікальним.",
               'INFJ': "1. Інтуїція: INFJ володіють сильним інтуїтивним сприйняттям світу, вони можуть передбачати та розуміти складні взаємозв'язки.\n\n2. Співчуття: Їхній особистий внутрішній світ зазвичай насичений співчуттям і розумінням емоцій інших людей.\n\n3. Креативність: INFJ можуть мати сильний творчий потенціал, вони здатні до інноваційних рішень та глибоких думок.\n\n4. Систематичність: Вони можуть мати схильність до структурування свого життя та діяльності навколо певних цілей та цінностей.\n\n5. Незалежність: INFJ зазвичай цінують свою незалежність і можуть працювати самостійно над своїми ідеями та проектами.\n\n6. Цілеспрямованість: Вони можуть мати високі стандарти для себе і інших, працюючи наполегливо для досягнення своїх цілей.\n\n7. Справедливість: INFJ зазвичай цінують справедливість та етичні принципи, і можуть виступати на захист прав інших людей.\n\n8. Відстороненість: Іноді вони можуть бути відстороненими або відчувати себе не зовсім впевнено у соціальних ситуаціях.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні унікальні варіації цих рис, що робить кожного INFJ унікальним.",
               'INFP': "1. Внутрішній світ: INFP зазвичай мають багатий внутрішній світ і глибокі емоції. Вони часто спрямовані на внутрішні цінності та ідеали.\n\n2. Інтуїція: Їхня основна способність сприйняття - це інтуїція. Вони можуть бачити потенціал та можливості в майбутньому.\n\n3. Емпатія: INFP здатні співчувати та розуміти емоції інших людей, часто вони виявляються добрими слухачами та підтримкою.\n\n4. Креативність: Вони можуть мати сильний творчий потенціал і здатні до самовираження через мистецтво, письмо або інші творчі заняття.\n\n5. Автентичність: INFP цінують індивідуальність та автентичність, ставлячи важливість на відповідність своїм власним цінностям і переконанням.\n\n6. Гнучкість: Вони можуть бути гнучкими і відкритими до нових ідей та перспектив, шукаючи глибоке розуміння себе та світу.\n\n7. Незалежність: INFP зазвичай цінують свою незалежність і можуть віддавати перевагу роботі, де вони можуть працювати самостійно над своїми ідеями.\n\n8. Схильність до перфекціонізму: Іноді вони можуть бути схильними до перфекціонізму та критикувати себе за невідповідність їхнім власним стандартам.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного INFP унікальним.",
               'ENFJ': "1. Екстраверсія: ENFJ зазвичай є енергійними та співчутливими. Вони насолоджуються взаємодією з людьми і зазвичай виявляються в центрі уваги в соціальних ситуаціях.\n\n2. Емпатія: Їхній сильний емоційний інтелект дозволяє їм легко розуміти та співчувати іншим людям. Вони здатні відчувати потреби та емоції інших.\n\n3. Лідерські якості: ENFJ часто є природніми лідерами, які можуть об'єднати людей навколо спільної мети та надихати їх до досягнення успіху.\n\n4. Здатність до мотивації: Вони володіють здатністю мотивувати і надихати інших, допомагаючи їм розвиватися та досягати своїх цілей.\n\n5. Систематичність: Хоча вони можуть бути спрямовані на емоції та взаємозв'язки, ENFJ також можуть бути добре організованими та систематичними.\n\n6. Тактовність: Вони зазвичай володіють високим рівнем тактовності та чутливості до потреб та почуттів інших.\n\n7. Справедливість: ENFJ цінують справедливість та рівність, і можуть виступати на захист прав та інтересів інших людей.\n\n8. Комунікативність: Вони володіють сильними комунікативними навичками і можуть ефективно виражати свої думки та ідеї.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного ENFJ унікальним.",
               'ENFP': "1. Екстраверсія: ENFP зазвичай є жвавими і енергійними, насолоджуючись взаємодією з іншими та відчуваючи енергію від соціальних подій.\n\n2. Інтуїція: Їхнє головне засіб сприйняття світу - це інтуїція. Вони бачать можливості та шукають нові ідеї та перспективи.\n\n3. Емоційна відкритість: ENFP відомі своєю емоційною відкритістю та здатністю відчувати глибокі емоції як у себе, так і в інших.\n\n4. Креативність: Вони зазвичай мають сильний творчий потенціал і люблять виражати себе через мистецтво, письмо, музику або інші творчі заняття.\n\n5. Спонтанність: ENFP можуть бути спонтанними та гнучкими, вони можуть змінювати плани в останній момент і відкриті до нових пригод.\n\n6. Ентузіазм: Вони зазвичай мають високий рівень ентузіазму та оптимізму, що може бути заразливим для інших.\n\n7. Незалежність: ENFP цінують свою незалежність та можуть працювати самостійно над своїми ідеями та проектами.\n\n8. Дружелюбність: Вони зазвичай мають теплий та дружелюбний характер, і легко знаходять спільну мову з різними людьми.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного ENFP унікальним.",
               'ISTJ': "1. Систематичність: ISTJ зазвичай володіють сильними організаційними навичками та цінують порядок і стабільність в житті.\n\n2. Сенсорика: Їхній основний спосіб сприйняття світу - це сенсорика. Вони довіряють конкретним фактам та доказам, уникаючи великих абстракцій.\n\n3. Логіка: ISTJ виявляються прагматичними та об'єктивними у вирішенні проблем, вони використовують логічне мислення для досягнення своїх цілей.\n\n4. Відповідальність: Вони зазвичай відзначаються великою відповідальністю і відданістю своїм обов'язкам і зобов'язанням.\n\n5. Стабільність: ISTJ цінують стабільність та надійність, вони шукають безпеки в рутинних та добре структурованих ситуаціях.\n\n6. Традиціоналізм: Вони можуть бути традиціоналістами і віддавати перевагу старовинним цінностям та звичаям.\n\n7. Обов'язковість: ISTJ зазвичай дотримуються правил і норм, вони цінують порядок і дисципліну в житті.\n\n8. Скромність: Вони часто виявляються скромними та пригніченими у виявленні своїх досягнень.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного ISTJ унікальним.",
               'ISFJ': "1. Співчуття: ISFJ володіють високою рівнем емпатії та співчуття. Вони часто ставлять потреби інших перед своїми власними.\n\n2. Сенсорика: Їхній основний спосіб сприйняття світу - це сенсорика. Вони зосереджені на конкретних фактах і деталях, уникаючи великих загальних концепцій.\n\n3. Обов'язковість: ISFJ зазвичай володіють сильним почуттям обов'язку і відданості своїм обов'язкам та зобов'язанням.\n\n4. Надійність: Вони відомі своєю надійністю та відданістю. Інші люди можуть покладатися на них у складних ситуаціях.\n\n5. Традиціоналізм: ISFJ можуть бути традиціоналістами, вони цінують стабільність та старовинні цінності.\n\n6. Систематичність: Вони можуть бути організованими та систематичними, віддаючи перевагу рутині та структурованому підходу до життя.\n\n7. Уважність до деталей: ISFJ зазвичай звертають увагу на дрібниці та деталі, вони володіють пильним спостереженням.\n\n8. Скромність: Вони можуть бути скромними та уникати виявлення своїх досягнень або заслуг.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного ISFJ унікальним.",
               'ESTJ': "1. Екстраверсія: ESTJ зазвичай є енергійними та екстравертованими. Вони насолоджуються соціальними взаємодіями та виявляються енергійними у великих групах.\n\n2. Сенсорика: Їхній основний спосіб сприйняття світу - це сенсорика. Вони зосереджені на конкретних фактах і деталях, уникаючи абстракцій.\n\n3. Лідерство: ESTJ зазвичай мають сильні лідерські якості і здатні ефективно керувати групами та організаціями.\n\n4. Організованість: Вони цінують порядок і структуру в житті і в роботі. ESTJ зазвичай володіють сильними організаційними навичками.\n\n5. Рішучість: Вони можуть бути рішучими та наполегливими в досягненні своїх цілей і завдань.\n\n6. Обов'язковість: ESTJ володіють великим почуттям обов'язку і відданості своїм обов'язкам і зобов'язанням.\n\n7. Справедливість: Вони цінують справедливість та рівність, і можуть виступати на захист прав та інтересів інших людей.\n\n8. Прагнення до результату: Вони зазвичай фокусуються на досягненні результатів і можуть бути відчутними в робочих ситуаціях.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного ESTJ унікальним.",
               'ESFJ': "1. Екстраверсія: ESFJ зазвичай є дружніми та екстравертованими. Вони отримують енергію від взаємодії з іншими і зазвичай виявляються центром уваги в соціальних ситуаціях.\n\n2. Сенсорика: Їхній основний спосіб сприйняття світу - це сенсорика. Вони зосереджені на конкретних деталях та фактах, уникаючи абстракцій.\n\n3. Співчуття: ESFJ володіють високим рівнем емпатії та співчуття. Вони часто ставлять потреби інших перед своїми власними.\n\n4. Організованість: Вони цінують порядок і структуру в житті і в роботі. ESFJ можуть бути добре організованими та ефективно керувати діяльністю.\n\n5. Традиціоналізм: Вони можуть бути традиціоналістами і цінувати старовинні цінності та звичаї.\n\n6. Комунікабельність: Вони зазвичай виявляються добре в комунікації з іншими людьми і можуть легко встановлювати зв'язки.\n\n7. Відданість: ESFJ зазвичай володіють великою відданістю своїм близьким та оточенню.\n\n8. Емоційна виразність: Вони можуть бути емоційно виразними і добре виражати свої почуття та емоції.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного ESFJ унікальним.",
               'ISTP': "1. Спонтанність: ISTP зазвичай є природними пригодниками, які насолоджуються моментом і швидко адаптуються до змін.\n\n2. Сенсорика: Їхній основний спосіб сприйняття світу - це сенсорика. Вони звертають увагу на конкретні факти та деталі в навколишньому середовищі.\n\n3. Логіка: ISTP виявляються аналітичними та об'єктивними, вони шукають логічні рішення для проблем.\n\n4. Рішучість: Вони можуть бути впевненими і рішучими у прийнятті рішень, особливо в кризових ситуаціях.\n\n5. Незалежність: ISTP цінують свою незалежність і можуть віддавати перевагу праці в самоті або в невеликих групах.\n\n6. Практичність: Вони володіють практичним мисленням і шукають ефективні рішення для реальних проблем.\n\n7. Спокій: ISTP зазвичай виявляються спокійними та зосередженими, навіть у стресових ситуаціях.\n\n8. Адаптивність: Вони можуть швидко адаптуватися до змінуються умов і ефективно вирішувати проблеми в реальному часі.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного ISTP унікальним.",
               'ISFP': "1. Спонтанність: ISFP зазвичай є креативними та спонтанними. Вони люблять нові враження і насолоджуються моментом.\n\n2. Сенсорика: Їхній основний спосіб сприйняття світу - це сенсорика. Вони звертають увагу на конкретні деталі та емоції в навколишньому середовищі.\n\n3. Емоційна відкритість: ISFP володіють глибокими емоціями і можуть виражати себе через мистецтво, музику або інші творчі заняття.\n\n4. Автентичність: Вони цінують індивідуальність та автентичність, ставлячи важливість на відповідність своїм власним цінностям і переконанням.\n\n5. Гнучкість: ISFP можуть бути гнучкими і відкритими до нових ідей та перспектив, шукаючи глибоке розуміння себе та світу.\n\n6. Співчуття: Вони виявляють співчуття та розуміння до емоцій інших людей, часто беручи на себе роль добрих слухачів і підтримки.\n\n7. Незалежність: ISFP цінують свою незалежність і можуть працювати самостійно над своїми творчими проектами і ідеями.\n\n8. Природність: Вони зазвичай є природними і спонтанними у своїх діях і вираженні емоцій.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного ISFP унікальним.",
               'ESTP': "1. Екстраверсія: ESTP зазвичай є енергійними та екстравертованими. Вони насолоджуються соціальними подіями і вміють легко вступати в контакт з іншими людьми.\n\n2. Сенсорика: Їхній основний спосіб сприйняття світу - це сенсорика. Вони звертають увагу на конкретні деталі та факти, уникаючи абстракцій.\n\n3. Ризикованість: ESTP зазвичай люблять пригоди та ризикувати. Вони можуть бути сміливими та готовими випробувати нові речі.\n\n4. Лідерські якості: Вони можуть мати сильні лідерські якості і вміти ефективно керувати групою або ситуацією.\n\n5. Практичність: ESTP володіють практичним мисленням і шукають ефективні рішення для реальних проблем.\n\n6. Спонтанність: Вони можуть бути спонтанними та готовими адаптуватися до змін, швидко реагуючи на нові ситуації.\n\n7. Комунікабельність: Вони виявляються відмінними в комунікації з іншими людьми і можуть легко знаходити спільну мову з різними групами.\n\n8. Ентузіазм: ESTP зазвичай мають високий рівень ентузіазму та оптимізму, що може бути заразливим для оточуючих.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного ESTP унікальним.",
               'ESFP': "1. Екстраверсія: ESFP зазвичай є енергійними та екстравертованими. Вони насолоджуються соціальними подіями і вміють легко вступати в контакт з іншими людьми.\n\n2. Сенсорика: Їхній основний спосіб сприйняття світу - це сенсорика. Вони звертають увагу на конкретні деталі та факти, уникаючи абстракцій.\n\n3. Емоційна відкритість: ESFP володіють глибокими емоціями і можуть виражати себе через мистецтво, музику, танець або інші творчі заняття.\n\n4. Спонтанність: Вони можуть бути спонтанними та готовими адаптуватися до змін, швидко реагуючи на нові ситуації.\n\n5. Ентузіазм: ESFP зазвичай мають високий рівень ентузіазму та оптимізму, що може бути заразливим для оточуючих.\n\n6. Співчуття: Вони виявляють співчуття та розуміння до емоцій інших людей, часто беручи на себе роль добрих слухачів і підтримки.\n\n7. Незалежність: ESFP цінують свою незалежність і можуть працювати самостійно над своїми творчими проектами і ідеями.\n\n8. Комунікабельність: Вони виявляються добре в комунікації з іншими людьми і можуть легко знаходити спільну мову з різними групами.\n\nЦе загальна характеристика, і кожна особистість може мати свої власні варіації цих рис, що робить кожного ESFP унікальним."}

person_photos = {'INTJ': "AgACAgIAAxkBAAIF3WXxdqQvqHFrzxQrHZpL1omNCZ68AALa1TEbW5iQS0mwlWkHgoT4AQADAgADeQADNAQ",
                 'INTP': "AgACAgIAAxkBAAIF32XxdshlrzpJI7BpA94Z5xqtFLvSAALb1TEbW5iQSxw60dLinE1bAQADAgADeQADNAQ",
                 'ENTJ': "AgACAgIAAxkBAAIF4WXxdvJsHolqGZgXuJcckhAvoIXCAALf1TEbW5iQS1uJPJHWV-w0AQADAgADeQADNAQ",
                 'ENTP': "AgACAgIAAxkBAAIF42XxdyRjJ8JXlgsAAfTMqCPuFeacawAC4NUxG1uYkEuYwPC8U7nBQgEAAwIAA3kAAzQE",
                 'INFJ': "AgACAgIAAxkBAAIF5WXxd1GCA9lE1fiqJRE5Q3i3F5-rAALh1TEbW5iQS8JYq_FkGhDtAQADAgADeQADNAQ",
                 'INFP': "AgACAgIAAxkBAAIF52Xxd3led1DK_eSFYb_HVitMr030AALi1TEbW5iQS4fnmaqe7lNlAQADAgADeQADNAQ",
                 'ENFJ': "AgACAgIAAxkBAAIF6WXxd6roAAGCqEpJdb2TSn_udvu4oQAC49UxG1uYkEuOHT9PSDtbrQEAAwIAA3kAAzQE",
                 'ENFP': "AgACAgIAAxkBAAIF62Xxd8f5NoMlfyR7xywgk0ERKuVdAALk1TEbW5iQS9v9dbyfJ6QnAQADAgADeQADNAQ",
                 'ISTJ': "AgACAgIAAxkBAAIF7WXxd-npOSM40FeKPjmM3JxnhQwXAALl1TEbW5iQS2M2_oDGF0HHAQADAgADeQADNAQ",
                 'ISFJ': "AgACAgIAAxkBAAIF72XxeAx9ey5dQHx7j-vbjyia5HK_AALn1TEbW5iQSztYrJF3VGhuAQADAgADeQADNAQ",
                 'ESTJ': "AgACAgIAAxkBAAIF8WXxeEApipOk5DKqugsqtOZjsGXtAALo1TEbW5iQS1l1k68ECgp0AQADAgADeQADNAQ",
                 'ESFJ': "AgACAgIAAxkBAAIF82XxeF8VdSkSJ-6Wd02c2mHePRNdAALp1TEbW5iQS6Jt_EcpasxHAQADAgADeQADNAQ",
                 'ISTP': "AgACAgIAAxkBAAIF9WXxeJ_J1OnL5U9Z6rocLBMZcFKLAALr1TEbW5iQS233CUrVCkWaAQADAgADeQADNAQ",
                 'ISFP': "AgACAgIAAxkBAAIF92XxeLi0EvMw75sAAY32rVJM3pWnMQAC7NUxG1uYkEvH8h3j-PNtSAEAAwIAA3kAAzQE",
                 'ESTP': "AgACAgIAAxkBAAIF-WXxeNF6q388cXXBa2cBTaPiLT57AALt1TEbW5iQS9-dApYV5Ip-AQADAgADeQADNAQ",
                 'ESFP': "AgACAgIAAxkBAAIF-2XxeP3I6hGpJ0nnmC4Fw1cgAAGCJgAC7tUxG1uYkEvMQIBlNUahTwEAAwIAA3kAAzQE"}

async def start_mbti_test(message: Message, bot: Bot):
    deleter[message.from_user.id] = []
    deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, 'Ви віддаєте перевагу тихим, спокійним місцям', reply_markup=mbti_test_keyboard()))
    users_data[message.from_user.id] = [0, 0, 0, 0, 0]
    time.sleep(1)
    try:
        for i in special[message.from_user.id]:
            await i.delete()
        special.clear()
    except KeyError:
        pass
    await chat_text1[message.from_user.id].delete()


async def get100true(message: Message, bot: Bot):
    if users_data[message.from_user.id][4] < 5:
        users_data[message.from_user.id][0] += 3
    elif users_data[message.from_user.id][4] < 10:
        users_data[message.from_user.id][1] += 3
    elif users_data[message.from_user.id][4] < 15:
        users_data[message.from_user.id][2] += 3
    elif users_data[message.from_user.id][4] < 20:
        users_data[message.from_user.id][3] += 3

    if users_data[message.from_user.id][4] != 19:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, f'{question[users_data[message.from_user.id][4]]}',reply_markup=mbti_test_keyboard()))
    else:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, 'ПЕРЕГЛЯНУТИ РЕЗУЛЬТАТ 📈', reply_markup=to_result_mbti_keyboard()))

    users_data[message.from_user.id][4] += 1
    time.sleep(1)
    await deleter[message.from_user.id][-1].delete()
    deleter[message.from_user.id].pop()


async def get50true(message: Message, bot: Bot):
    if users_data[message.from_user.id][4] < 5:
        users_data[message.from_user.id][0] += 2
    elif users_data[message.from_user.id][4] < 10:
        users_data[message.from_user.id][1] += 2
    elif users_data[message.from_user.id][4] < 15:
        users_data[message.from_user.id][2] += 2
    elif users_data[message.from_user.id][4] < 20:
        users_data[message.from_user.id][3] += 2

    if users_data[message.from_user.id][4] != 19:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, f'{question[users_data[message.from_user.id][4]]}',reply_markup=mbti_test_keyboard()))
    else:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, 'ПЕРЕГЛЯНУТИ РЕЗУЛЬТАТ 📈', reply_markup=to_result_mbti_keyboard()))

    users_data[message.from_user.id][4] += 1
    time.sleep(1)
    await deleter[message.from_user.id][-1].delete()
    deleter[message.from_user.id].pop()



async def get25true(message: Message, bot: Bot):
    if users_data[message.from_user.id][4] < 5:
        users_data[message.from_user.id][0] += 1
    elif users_data[message.from_user.id][4] < 10:
        users_data[message.from_user.id][1] += 1
    elif users_data[message.from_user.id][4] < 15:
        users_data[message.from_user.id][2] += 1
    elif users_data[message.from_user.id][4] < 20:
        users_data[message.from_user.id][3] += 1

    if users_data[message.from_user.id][4] != 19:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, f'{question[users_data[message.from_user.id][4]]}',reply_markup=mbti_test_keyboard()))
    else:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, 'ПЕРЕГЛЯНУТИ РЕЗУЛЬТАТ 📈', reply_markup=to_result_mbti_keyboard()))

    users_data[message.from_user.id][4] += 1
    time.sleep(1)
    await deleter[message.from_user.id][-1].delete()
    deleter[message.from_user.id].pop()



async def none(message: Message, bot: Bot):
    if users_data[message.from_user.id][4] < 5:
        users_data[message.from_user.id][0] += 0.1
    elif users_data[message.from_user.id][4] < 10:
        users_data[message.from_user.id][1] += 0.1
    elif users_data[message.from_user.id][4] < 15:
        users_data[message.from_user.id][2] += 0.1
    elif users_data[message.from_user.id][4] < 20:
        users_data[message.from_user.id][3] += 0.1

    if users_data[message.from_user.id][4] != 19:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, f'{question[users_data[message.from_user.id][4]]}',reply_markup=mbti_test_keyboard()))
    else:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, 'ПЕРЕГЛЯНУТИ РЕЗУЛЬТАТ 📈', reply_markup=to_result_mbti_keyboard()))

    users_data[message.from_user.id][4] += 1
    time.sleep(1)
    await deleter[message.from_user.id][-1].delete()
    deleter[message.from_user.id].pop()



async def get25false(message: Message, bot: Bot):
    if users_data[message.from_user.id][4] < 5:
        users_data[message.from_user.id][0] -= 1
    elif users_data[message.from_user.id][4] < 10:
        users_data[message.from_user.id][1] -= 1
    elif users_data[message.from_user.id][4] < 15:
        users_data[message.from_user.id][2] -= 1
    elif users_data[message.from_user.id][4] < 20:
        users_data[message.from_user.id][3] -= 1

    if users_data[message.from_user.id][4] != 19:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, f'{question[users_data[message.from_user.id][4]]}',reply_markup=mbti_test_keyboard()))
    else:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, 'ПЕРЕГЛЯНУТИ РЕЗУЛЬТАТ 📈', reply_markup=to_result_mbti_keyboard()))

    users_data[message.from_user.id][4] += 1
    time.sleep(1)
    await deleter[message.from_user.id][-1].delete()
    deleter[message.from_user.id].pop()
    print(users_data[message.from_user.id])


async def get50false(message: Message, bot: Bot):
    if users_data[message.from_user.id][4] < 5:
        users_data[message.from_user.id][0] -= 2
    elif users_data[message.from_user.id][4] < 10:
        users_data[message.from_user.id][1] -= 2
    elif users_data[message.from_user.id][4] < 15:
        users_data[message.from_user.id][2] -= 2
    elif users_data[message.from_user.id][4] < 20:
        users_data[message.from_user.id][3] -= 2

    if users_data[message.from_user.id][4] != 19:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, f'{question[users_data[message.from_user.id][4]]}',reply_markup=mbti_test_keyboard()))
    else:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, 'ПЕРЕГЛЯНУТИ РЕЗУЛЬТАТ 📈', reply_markup=to_result_mbti_keyboard()))

    users_data[message.from_user.id][4] += 1
    time.sleep(1)
    await deleter[message.from_user.id][-1].delete()
    deleter[message.from_user.id].pop()


async def get100false(message: Message, bot: Bot):
    if users_data[message.from_user.id][4] < 5:
        users_data[message.from_user.id][0] -= 3
    elif users_data[message.from_user.id][4] < 10:
        users_data[message.from_user.id][1] -= 3
    elif users_data[message.from_user.id][4] < 15:
        users_data[message.from_user.id][2] -= 3
    elif users_data[message.from_user.id][4] < 20:
        users_data[message.from_user.id][3] -= 3

    if users_data[message.from_user.id][4] != 19:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, f'{question[users_data[message.from_user.id][4]]}', reply_markup=mbti_test_keyboard()))
    else:
        deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, 'ПЕРЕГЛЯНУТИ РЕЗУЛЬТАТ 📈', reply_markup=to_result_mbti_keyboard()))

    users_data[message.from_user.id][4] += 1
    time.sleep(1)
    await deleter[message.from_user.id][-1].delete()
    deleter[message.from_user.id].pop()


async def get_mbti_result(message: Message, bot: Bot):
    result_mbti = {}
    result_mbti[message.from_user.id] = []
    if users_data[message.from_user.id][0] > 0:
        result_mbti[message.from_user.id].append('I')
    else:
        result_mbti[message.from_user.id].append('E')

    if users_data[message.from_user.id][1] > 0:
        result_mbti[message.from_user.id].append('N')
    else:
        result_mbti[message.from_user.id].append('S')

    if users_data[message.from_user.id][2] > 0:
        result_mbti[message.from_user.id].append('T')
    else:
        result_mbti[message.from_user.id].append('F')

    if users_data[message.from_user.id][3] > 0:
        result_mbti[message.from_user.id].append('J')
    else:
        result_mbti[message.from_user.id].append('P')

    time.sleep(1)
    deleter[message.from_user.id].insert(0, await bot.send_message(message.from_user.id, f'{person_text[''.join(result_mbti[message.from_user.id])]}'))
    deleter[message.from_user.id].insert(0, await bot.send_photo(message.from_user.id, f'{person_photos[''.join(result_mbti[message.from_user.id])]}', reply_markup=back_from_result()))
    await deleter[message.from_user.id][-1].delete()
    deleter[message.from_user.id].pop()




